`timescale 1ns/1ps

module tb_1;

    reg clk;
    reg rst;

    // ============================================================
    // DUT
    // ============================================================

    top dut (
        .clk(clk),
        .rst(rst)
    );

    // ============================================================
    // Clock
    // ============================================================

    initial clk = 1'b0;
    always #5 clk = ~clk;

    // ============================================================
    // Reset
    // ============================================================

    initial begin
        rst = 1'b1;

        repeat (3) @(posedge clk);

        rst = 1'b0;
    end

    // ============================================================
    // Main
    // ============================================================

    initial begin

        wait(rst == 1'b0);

        // 给 CPU 足够时间执行测试程序
        repeat (100) @(posedge clk);

        $finish;
    end

    // ============================================================
    // Pipeline Monitor
    // ============================================================

    always @(posedge clk) begin
    #1;
    $display(
        "T=%0t | PC=%08h | ID=%08h | ID_pc4=%08h | ID_imm=%08h | SelPC=%b",
        $time,
        dut.cpu_u.inst_addr,
        dut.cpu_u.ID_instr,
        dut.cpu_u.ID_pc_plus_4,
        dut.cpu_u.ID_imm,
        dut.cpu_u.sel_next_pc
    );
end

    
endmodule